In [6]:
import pandas as pd

# dictionary of lists
child_info = pd.DataFrame({'ChildId':['id1', 'id2', 'id3', 'id4', 'id5'],
                           'Age at first contact':[6, 12, 11, 1, 19],
                           'SEX':['M', 'm', 'F', '', 'F'],
                           'Birthday':['01/01/2002', '02/02/2003', '01/01/2000', '03/03/2023', '06/01/2012'],
                           'CP Plan?':['Y', 'n', 'N', 'No', 'yES'],})

# list of dictionaries
nhs_numbers = pd.DataFrame([{'ChildId':'id1',
                             'NHS Number':'303'},
                             {'ChildId':'id2',
                              'NHS Number':'3u5029'},
                            {'ChildId':'id3',
                            'NHS Number': 'gqw3',},
                            {'ChildId':'id4',
                            'NHS Number': 'avsgvb',},
                            {'ChildId':'id5',
                            'NHS Number': 'varwvw',},])

nhs_numbers

  ChildId NHS Number
0     id1        303
1     id2     3u5029
2     id3       gqw3
3     id4     avsgvb
4     id5     varwvw

In [18]:
filepath = "https://github.com/data-to-insight/ERN-sessions/raw/main/data/903_xlsx_errors.xlsx"

dfs = pd.read_excel(filepath, sheet_name=None)
placed_for_adoption = dfs['placed_for_adoption']

placed_for_adoption['PLaced_dt'] = pd.to_datetime(placed_for_adoption['DATE_PLACED'], format="%d/%m/%Y", errors='coerce')

invalid_dates= placed_for_adoption [placed_for_adoption['PLaced_dt'].isna()]

print (placed_for_adoption)

          CHILD         DOB              DATE_PLACED      DATE_PLACED_CEASED  \
0        988635  15/06/2013               22/11/2015              07/04/2017
1        161125  24/07/2002               08/05/2015              24/02/2018
2        590545  24/11/2008               12/09/2015              23/04/2017
3        757606  12/12/2003               16/09/2015              23/02/2018
4        921450  11/10/2006               02/03/2015              15/08/2017
5          4022  11/05/2001               11/11/2015              30/12/2017
6        127650  24/02/2013               05/09/2015              22/06/2017
7        624227  04/07/2008               27/01/2015              24/09/2017
8        711458  06/05/2009               19/03/2015              27/11/2017
9        549562  25/07/2009               30/10/2015              22/11/2017
10        83008  05/06/2005               06/02/2015              16/10/2017
11       764585  01/06/2011               17/05/2015              08/12/2017
12       432916  28/01/2002               02/08/2015              08/03/2018
13       232351  08/11/2006               09/10/2015              02/08/2017
14       682447  10/07/2008               02/01/2015              03/11/2017
15       979106  11/04/2013               04/02/2015              12/01/2018
16       177224  16/04/2008               17/01/2015              02/11/2017
17       150309  12/12/2003               22/04/2015              10/04/2017
18       912765  25/04/2007               24/06/2015              02/05/2017
19       258758  09/01/2012               10/06/2015              22/04/2017
20       183392  03/09/2012               28/03/2015              02/03/2018
21       882662  24/07/2003               26/09/2015              22/11/2017
22       867782  20/09/2002               02/09/2015              04/04/2017
23       398366  07/06/2010               17/03/2015              29/05/2017
24       465676  09/05/2012               30/05/2015              29/05/2017
25       553789  15/07/2010               06/12/2015              08/02/2018
26       667633  26/10/2007               01/06/2015              02/05/2017
27       940956  02/04/2011               30/01/2015              29/11/2017
28       458257  21/02/2007               23/08/2015              03/01/2018
29  bad_entry_1  Not a date  This isn't a valid date  This also isn't a date

   REASON_PLACED_CEASED  PLaced_dt
0                   XXX 2015-11-22
1                   XXX 2015-05-08
2                   XXX 2015-09-12
3                   XXX 2015-09-16
4                   XXX 2015-03-02
5                   XXX 2015-11-11
6                   XXX 2015-09-05
7                   XXX 2015-01-27
8                   XXX 2015-03-19
9                   XXX 2015-10-30
10                  XXX 2015-02-06
11                  XXX 2015-05-17
12                  XXX 2015-08-02
13                  XXX 2015-10-09
14                  XXX 2015-01-02
15                  XXX 2015-02-04
16                  XXX 2015-01-17
17                  XXX 2015-04-22
18                  XXX 2015-06-24
19                  XXX 2015-06-10
20                  XXX 2015-03-28
21                  XXX 2015-09-26
22                  XXX 2015-09-02
23                  XXX 2015-03-17
24                  XXX 2015-05-30
25                  XXX 2015-12-06
26                  XXX 2015-06-01
27                  XXX 2015-01-30
28                  XXX 2015-08-23
29                  oop        NaT

In [21]:
# 103 - The ethnicity code is either not valid or has not been entered.
# header, ETHNIC - empty, or not a valid code
filepath = "https://github.com/data-to-insight/ERN-sessions/raw/main/data/903_xlsx_errors.xlsx"

dfs = pd.read_excel(filepath, sheet_name=None)

header= dfs['header']
ethnicity_codes = [
        "WBRI",
        "WIRI",
        "WOTH",
        "WIRT",
        "WROM",
        "MWBC",
        "MWBA",
        "MWAS",
        "MOTH",
        "AIND",
        "APKN",
        "ABAN",
        "AOTH",
        "BCRB",
        "BAFR",
        "BOTH",
        "CHNE",
        "OOTH",
        "REFU",
        "NOBT",
    ]

# .isin()

error_rows = header[~header['ETHNIC'].isin(ethnicity_codes)]

error_rows

            CHILD  SEX    DOB ETHNIC    UPN  MOTHER MC_DOB
2675  bad_entry_1    7  oops!  Alien  UPDOG     NaN    NaN

In [22]:
# 102 - date of birth is not a valid date
# d/m/y format
# to_datetime() - format argument - "%d/%m/%Y"
# errors="coerce" - NA 

header = dfs['header']

header['DOB_dt'] = pd.to_datetime(header['DOB'], format="%d/%m/%Y", errors='coerce')

invalid_dobs = header['DOB_dt'].isna()

error_rows = header[invalid_dobs]

error_rows

            CHILD  SEX    DOB ETHNIC    UPN  MOTHER MC_DOB DOB_dt
2675  bad_entry_1    7  oops!  Alien  UPDOG     NaN    NaN    NaT